### Shelmith Kariuki üë©‚ÄçüíªüíÉ
### Strings
### 8th November, 2018

There are various string operations in R that I find myself using on a daily basis. This include gsub (used to substitute a string with another one) and grepl(used to look for a string pattern in a given string statement).

So I am going to try the same here in python. Wish me luck!!

Question 1: How would we remove leading or trailing spaces in a string value?

In [1]:
counties = [" Nyeri","Kisumu","Kirinyaga"," Mombasa","Eldoret "]
counties

[' Nyeri', 'Kisumu', 'Kirinyaga', ' Mombasa', 'Eldoret ']

From the data above, you can see that the counties Nyeri, Mombasa and Eldoret have leading and trailing spaces, that need to be removed.

In [2]:
space_stripper = lambda x: x.strip()
space_stripper = map(space_stripper,counties)
print(list(space_stripper))

['Nyeri', 'Kisumu', 'Kirinyaga', 'Mombasa', 'Eldoret']

üíÉ üíÉ üíÉ üíÉ üíÉ.....I have done it. I learnt lambda and map function yesterday, and have used the same to apply the strip() function, to remove white spaces.

Question 2: How would you remove or replace strings with other strings in python?

In [3]:
cell_numbers = [" +254766567821"," +254786786482"," +254765098672"," +254745635612",
                "+254786534234 "]
cell_numbers

[' +254766567821',
 ' +254786786482',
 ' +254765098672',
 ' +254745635612',
 '+254786534234 ']

So what we want to do, is to replace the kenyan code (+254) with 0, remove the trailing and leading spaces and convert the numbers to numeric.

In [4]:
## Remove the spaces
cell_numbers = list(map(lambda x: x.strip(),cell_numbers))
print(cell_numbers)

## Replace +254 with 0
cell_numbers2 = list(map(lambda x: x.replace("+254","0"),cell_numbers))
print(cell_numbers2)

['+254766567821', '+254786786482', '+254765098672', '+254745635612', '+254786534234']
['0766567821', '0786786482', '0765098672', '0745635612', '0786534234']

In [5]:
num = " +254766567821"
num =num.replace("+254","0")
num

' 0766567821'

In [6]:
c = lambda x: x.replace("+254","0")
c(" +254766567821")
c("+254765098672")

'0765098672'

Question 3: Splitting a variable into two or more parts

In [7]:
import pandas as pd
names = ["Shelmith Kariuki","Silvia Kahihu","James Kengah","James Macharia","Christine Okeyo",
        "Cyrus Muriithi","Michael Osunga"]

firstname = list(map(lambda x: x.split(" ")[0],names))
print(firstname)
lastname = list(map(lambda x: x.split(" ")[1],names))
print(lastname)

names_table = pd.DataFrame({"Full_Name":names, "First_Name":firstname,"Last_Name":lastname})
names_table

['Shelmith', 'Silvia', 'James', 'James', 'Christine', 'Cyrus', 'Michael']
['Kariuki', 'Kahihu', 'Kengah', 'Macharia', 'Okeyo', 'Muriithi', 'Osunga']

          Full_Name First_Name Last_Name
0  Shelmith Kariuki   Shelmith   Kariuki
1     Silvia Kahihu     Silvia    Kahihu
2      James Kengah      James    Kengah
3    James Macharia      James  Macharia
4   Christine Okeyo  Christine     Okeyo
5    Cyrus Muriithi      Cyrus  Muriithi
6    Michael Osunga    Michael    Osunga

Question 4: Generate a variable that indicates the first letter of a string.

In [8]:
# first_letter = list(map(lambda x: list(x)[0],names_table["First_Name"]))
# first_letter
names_table["First_Letter"]=list(map(lambda x: list(x)[0],names_table["First_Name"]))
names_table

          Full_Name First_Name Last_Name First_Letter
0  Shelmith Kariuki   Shelmith   Kariuki            S
1     Silvia Kahihu     Silvia    Kahihu            S
2      James Kengah      James    Kengah            J
3    James Macharia      James  Macharia            J
4   Christine Okeyo  Christine     Okeyo            C
5    Cyrus Muriithi      Cyrus  Muriithi            C
6    Michael Osunga    Michael    Osunga            M